; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v1)
		(pred_3 ?v4)
		(pred_4 ?v2)
		(pred_1 ?v2)
		(pred_5 ?v4 ?v2)
		(pred_6)
		(pred_2 ?v4))

   (:action op_2
       :parameters  (?v8 ?v3)
       :precondition (and (not-eq ?v8 ?v3) 
                          (pred_4 ?v8) (pred_4 ?v3) (pred_1 ?v8))
       :effect (and  (pred_1 ?v3)
		     (not (pred_1 ?v8))))


   (:action op_1
       :parameters (?v5 ?v6)
       :precondition  (and  (pred_3 ?v5) (pred_4 ?v6)
			    (pred_5 ?v5 ?v6) (pred_1 ?v6) (pred_6))
       :effect (and (pred_2 ?v5)
		    (not (pred_5 ?v5 ?v6)) 
		    (not (pred_6))))

   (:action op_3
       :parameters  (?v5  ?v6)
       :precondition  (and  (pred_3 ?v5) (pred_4 ?v6)
			    (pred_2 ?v5) (pred_1 ?v6))
       :effect (and (pred_5 ?v5 ?v6)
		    (pred_6)
		    (not (pred_2 ?v5)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_04 obj_05 obj_07 obj_01 obj_02 obj_09 
          obj_08 obj_03 obj_06 
)
(:init
(pred_4 obj_04)
(pred_4 obj_05)
(pred_4 obj_07)
(pred_4 obj_01)
(pred_4 obj_02)
(pred_4 obj_09)
(pred_3 obj_08)
(pred_3 obj_03)
(pred_3 obj_06)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_04)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_07)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_02 obj_09)
(not-eq obj_09 obj_02)
(pred_6)
(pred_5 obj_08 obj_04)
(pred_5 obj_03 obj_07)
(pred_5 obj_06 obj_02)
(pred_1 obj_05)
)
(:goal
(and
(pred_5 obj_08 obj_01)
(pred_5 obj_03 obj_07)
(pred_5 obj_06 obj_07)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_08 obj_01) (pred_1 obj_07))
    (sometime-before  (pred_5 obj_06 obj_07) (pred_1 obj_04))
  )
)
)

; plan
1. (op_2 obj_05 obj_02)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_02)
   goals met: 1 of 3
2. (op_1 obj_06 obj_02)
   deleted: (pred_5 obj_06 obj_02) (pred_6)
   added: (pred_2 obj_06)
   goals met: 1 of 3
3. (op_2 obj_02 obj_01)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_01)
   goals met: 1 of 3
4. (op_2 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 1 of 3
5. (op_2 obj_07 obj_04)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_04)
   goals met: 1 of 3
6. (op_3 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_5 obj_06 obj_04) (pred_6)
   goals met: 1 of 3
7. (op_1 obj_08 obj_04)
   deleted: (pred_5 obj_08 obj_04) (pred_6)
   added: (pred_2 obj_08)
   goals met: 1 of 3
8. (op_2 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_01)
   goals met: 1 of 3
9. (op_3 obj_08 obj_01)
   deleted: (pred_2 obj_08)
   added: (pred_5 obj_08 obj_01) (pred_6)
   goals met: 2 of 3
10. (op_2 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 2 of 3
11. (op_2 obj_07 obj_04)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_04)
   goals met: 2 of 3
12. (op_1 obj_06 obj_04)
   deleted: (pred_5 obj_06 obj_04) (pred_6)
   added: (pred_2 obj_06)
   goals met: 2 of 3
13. (op_2 obj_04 obj_07)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_07)
   goals met: 2 of 3
14. (op_3 obj_06 obj_07)
   deleted: (pred_2 obj_06)
   added: (pred_5 obj_06 obj_07) (pred_6)
   goals met: 3 of 3
